Revit 2021.1 API
UnitTypeId Properties
The UnitTypeId type exposes the following members.
Properties
Name | Description
Acres
Amperes
Atmospheres
Bars
BritishThermalUnits
BritishThermalUnitsPerDegreeFahrenheit
BritishThermalUnitsPerHour
BritishThermalUnitsPerHourCubicFoot
BritishThermalUnitsPerHourFootDegreeFahrenheit
BritishThermalUnitsPerHourSquareFoot
BritishThermalUnitsPerHourSquareFootDegreeFahrenheit
BritishThermalUnitsPerPound
BritishThermalUnitsPerPoundDegreeFahrenheit
BritishThermalUnitsPerSecond
Calories
CaloriesPerSecond
Candelas
CandelasPerSquareFoot
CandelasPerSquareMeter
Celsius
CelsiusInterval
Centimeters
CentimetersPerMinute
CentimetersToTheFourthPower
CentimetersToTheSixthPower
Centipoises
CubicCentimeters
CubicFeet
CubicFeetPerHour
CubicFeetPerKip
CubicFeetPerMinute
CubicFeetPerMinuteCubicFoot
CubicFeetPerMinutePerBritishThermalUnitPerHour
CubicFeetPerMinuteSquareFoot
CubicFeetPerMinuteTonOfRefrigeration
CubicFeetPerPoundMass
CubicInches
CubicMeters
CubicMetersPerHour
CubicMetersPerHourCubicMeter
CubicMetersPerHourSquareMeter
CubicMetersPerKilogram
CubicMetersPerKilonewton
CubicMetersPerSecond
CubicMetersPerWattSecond
CubicMillimeters
CubicYards
Currency
CurrencyPerBritishThermalUnit
CurrencyPerBritishThermalUnitPerHour
CurrencyPerSquareFoot
CurrencyPerSquareMeter
CurrencyPerWatt
CurrencyPerWattHour
Custom
CyclesPerSecond
Decimeters
Degrees
DegreesMinutes
DekanewtonMeters
DekanewtonMetersPerMeter
Dekanewtons
DekanewtonsPerMeter
DekanewtonsPerSquareMeter
Fahrenheit
FahrenheitInterval
Feet
FeetFractionalInches
FeetOfWater39_2DegreesFahrenheit
FeetOfWater39_2DegreesFahrenheitPer100Feet
FeetPerKip
FeetPerMinute
FeetPerSecond
FeetPerSecondSquared
FeetToTheFourthPower
FeetToTheSixthPower
Fixed
Footcandles
Footlamberts
FractionalInches
General
Gradians
GrainsPerHourSquareFootInchMercury
Hectares
Hertz
Horsepower
Hours
HourSquareFootDegreesFahrenheitPerBritishThermalUnit
Inches
InchesOfMercury32DegreesFahrenheit
InchesOfWater60DegreesFahrenheit
InchesOfWater60DegreesFahrenheitPer100Feet
InchesPerSecondSquared
InchesToTheFourthPower
InchesToTheSixthPower
InverseDegreesCelsius
InverseDegreesFahrenheit
InverseKilonewtons
InverseKips
Joules
JoulesPerGram
JoulesPerGramDegreeCelsius
JoulesPerKelvin
JoulesPerKilogramDegreeCelsius
Kelvin
KelvinInterval
Kiloamperes
Kilocalories
KilocaloriesPerSecond
KilogramForceMeters
KilogramForceMetersPerMeter
Kilograms
KilogramsForce
KilogramsForcePerMeter
KilogramsForcePerSquareMeter
KilogramsPerCubicMeter
KilogramsPerHour
KilogramsPerKilogramKelvin
KilogramsPerMeter
KilogramsPerMeterHour
KilogramsPerMeterSecond
KilogramsPerMinute
KilogramsPerSecond
KilogramsPerSquareMeter
Kilojoules
KilojoulesPerKelvin
KilometersPerHour
KilometersPerSecondSquared
KilonewtonMeters
KilonewtonMetersPerDegree
KilonewtonMetersPerDegreePerMeter
KilonewtonMetersPerMeter
Kilonewtons
KilonewtonsPerCubicMeter
KilonewtonsPerMeter
KilonewtonsPerSquareCentimeter
KilonewtonsPerSquareMeter
KilonewtonsPerSquareMillimeter
Kilopascals
KilovoltAmperes
Kilovolts
KilowattHours
Kilowatts
KipFeet
KipFeetPerDegree
KipFeetPerDegreePerFoot
KipFeetPerFoot
Kips
KipsPerCubicFoot
KipsPerCubicInch
KipsPerFoot
KipsPerInch
KipsPerSquareFoot
KipsPerSquareInch
Liters
LitersPerHour
LitersPerMinute
LitersPerSecond
LitersPerSecondCubicMeter
LitersPerSecondKilowatt
LitersPerSecondSquareMeter
Lumens
LumensPerWatt
Lux
MeganewtonMeters
MeganewtonMetersPerMeter
Meganewtons
MeganewtonsPerMeter
MeganewtonsPerSquareMeter
Megapascals
Meters
MetersCentimeters
MetersOfWaterColumn
MetersOfWaterColumnPerMeter
MetersPerKilonewton
MetersPerSecond
MetersPerSecondSquared
MetersToTheFourthPower
MetersToTheSixthPower
MicroinchesPerInchDegreeFahrenheit
MicrometersPerMeterDegreeCelsius
MilesPerHour
MilesPerSecondSquared
Milliamperes
Millimeters
MillimetersOfMercury
MillimetersOfWaterColumn
MillimetersOfWaterColumnPerMeter
MillimetersToTheFourthPower
MillimetersToTheSixthPower
Milliseconds
Millivolts
Minutes
NanogramsPerPascalSecondSquareMeter
NewtonMeters
NewtonMetersPerMeter
Newtons
NewtonSecondsPerSquareMeter
NewtonsPerMeter
NewtonsPerSquareMeter
NewtonsPerSquareMillimeter
OhmMeters
OneToRatio
Pascals
PascalSeconds
PascalsPerMeter
Percentage
PerMille
Pi
PoundForceFeet
PoundForceFeetPerFoot
PoundForceSecondsPerSquareFoot
PoundsForce
PoundsForcePerCubicFoot
PoundsForcePerFoot
PoundsForcePerSquareFoot
PoundsForcePerSquareInch
PoundsMass
PoundsMassPerCubicFoot
PoundsMassPerCubicInch
PoundsMassPerFoot
PoundsMassPerFootHour
PoundsMassPerFootSecond
PoundsMassPerHour
PoundsMassPerMinute
PoundsMassPerPoundDegreeFahrenheit
PoundsMassPerSecond
PoundsMassPerSquareFoot
Radians
RadiansPerSecond
Rankine
RankineInterval
RatioTo1
RatioTo10
RatioTo12
RevolutionsPerMinute
RevolutionsPerSecond
RiseDividedBy1000Millimeters
RiseDividedBy10Feet
RiseDividedBy120Inches
RiseDividedBy12Inches
RiseDividedBy1Foot
Seconds
SlopeDegrees
SquareCentimeters
SquareCentimetersPerMeter
SquareFeet
SquareFeetPer1000BritishThermalUnitsPerHour
SquareFeetPerFoot
SquareFeetPerKip
SquareFeetPerSecond
SquareFeetPerTonOfRefrigeration
SquareInches
SquareInchesPerFoot
SquareMeterKelvinsPerWatt
SquareMeters
SquareMetersPerKilonewton
SquareMetersPerKilowatt
SquareMetersPerMeter
SquareMetersPerSecond
SquareMillimeters
SquareMillimetersPerMeter
StationingFeet
StationingMeters
Therms
ThousandBritishThermalUnitsPerHour
TonneForceMeters
TonneForceMetersPerMeter
Tonnes
TonnesForce
TonnesForcePerMeter
TonnesForcePerSquareMeter
TonsOfRefrigeration
UsGallons
UsGallonsPerHour
UsGallonsPerMinute
UsSurveyFeet
UsTonnesForce
UsTonnesMass
VoltAmperes
Volts
Watts
WattsPerCubicFoot
WattsPerCubicFootPerMinute
WattsPerCubicMeter
WattsPerCubicMeterPerSecond
WattsPerFoot
WattsPerMeter
WattsPerMeterKelvin
WattsPerSquareFoot
WattsPerSquareMeter
WattsPerSquareMeterKelvin
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace